'''Task 1
Написати скрипт, який для п'яти цілочисельних значень (вводить користувач з клавіатури), знаходить мінімум, максимум та середнє.'''

print ('введіть 5 чисел')
a= int(input('a='))
b= int(input('b='))
c= int(input('c='))
d= int(input('d='))
e= int(input('e='))

print ('Min')
print (min(a, b, c, d, e))

print ('Max')
print (max(a, b, c, d, e))

print ('AVG')
print ((a+b+c+d+e)/5)

# коректний варіант

if __name__ == '__main__':
    a, b, c, d, e = int(input('a=')),\
                    int(input('b=')),\
                    int(input('c=')),\
                    int(input('d=')),\
                    int(input('e='))

    print('Max=', max(a, b, c, d, e))
    print('Min=', min(a, b, c, d, e))
    print('Avg=', (a + b + c + d + e) / 5)

'''Task 2
Написати скрипт, який буде повертати результат арифметичних дій +, -, *, /, // для заданих x та y.'''

x= float(input('x='))
y= float(input('y='))

print ('сума')
print (x+y)

print ('різниця')
print (x-y)

print ('Добуток')
print (x*y)

print ('частка')
print (x/y)

print ('частка ціла')
print (x//y)


# коректний варіант
a, b = int(input('a=')), int(input('b='))

print(f'a + b = {a + b}')
print(f'a - b = {a - b}')
print(f'a * b = {a * b}')
print(f'a / b = {a / b}')
print(f'a // b = {a // b}')
print(f'a % b = {a % b}')
print(f'a ** b = {a ** b}')

'''Task 3
Написати скрипт, який для кола заданого радіуса (вводить користувач з клавіатури) знаходить діаметр, довжину окружності і площу.'''
'''
діаметр = R*2
окружність = R*2*3.14
площа = 3.14*R*R
'''
print ('введіть радіус кола')
r= float(input('r ='))

print ('діаметр кола')
print (r*2)
print ('окружність кола')
print (r*2*3.14)
print ('площа кола')
print (r*r*3.14)

# коректний варіант
import math

r = int(input('R='))
print(f'D = {2 * r}')
print(f'L = {2 * r * math.pi}')
print(f'S = {math.pi * r ** 2}')

'''Task 4
Написати скрипт, яких тризначне ціле число (вводить користувач з клавіатури) розділяє на окремі цифри. Кожну цифру треба вивести в окремому рядку.
Наприклад, якщо користувач вводить число 987, скрипт має вивести в термінал
9
8
7
'''

a = input ('a=')
for c in a:
    print(c)

# коректний варіант
# Task 4
x = int(input('number='))

print(x // 100)
print(x // 10 % 10)
print(x % 10)

x = input('number=')
print(x[0])
print(x[1])
print(x[2])
'''Task 5
Деякі інвестиційні консультанти вважають, що розумно очікувати 10% прибутку в довгостроковій перспективі на фондовому ринку.
Припускаючи, що ви починаєте з 1000 доларів і залишаєте свої гроші інвестованими, обчисліть і відобразіть, скільки грошей ви матимете через 10, 20 і 30 років.
Використовуйте наступну формулу для визначення цих сум:
a = p(1 + r)^n
де p — початкова інвестована сума (тобто основна сума 1000 доларів США),
r – річна норма прибутку (10%),
n - кількість років (10, 20 або 30),
a — сума на депозиті на кінець n-го року.'''

p= float(1000)
r= float(0.1)
n1 = float(10)
n2 = float(20)
n3 = float(30)

print ('сума на депозиті після 10 років інвестування')
print (p*(1+r)**n1)
print ('сума на депозиті після 20 років інвестування')
print (p*(1+r)**n2)
print ('сума на депозиті після 30 років інвестування')
print (p*(1+r)**n3)

# коректний варіант
p = int(input('$='))
R = 0.1
n_1, n_2, n_3 = 10, 20, 30
print(f'10 years = {(p * (1 + R) ** n_1):.2f}')
print(f'20 years = {(p * (1 + R) ** n_2)}')
print(f'30 years = {p * (1 + R) ** n_3}')

print(f'30 years = {p * (1 + R) ** n_3}')







