
# Task 1
# Є дев'ятиповерховий будинок, в якому 4 під'їзди.
# Номер під'їзду починається з одиниці.
# На одному поверсі - 4 квартири.
# Напишіть програму, яка від користувача отримує номер квартири та виводить для заданої квартири
# номер під'їзду, поверху та номер на поверсі.
# Якщо такої квартира немає в цьому будинку, то необхідно повідомити користувача про це.

flat = int(input("Введіть номер квартири: "))

entrance = (flat - 1) // 36 + 1
floor = ((flat - 1) % 36) // 4 + 1
flat_on_floor = ((flat - 1) % 4) + 1

error = (1 <= flat <= 144)
message = error and f"Під'їзд: {entrance}, Поверх: {floor}, Номер на поверсі: {flat_on_floor}" or "Такої квартири немає в цьому будинку."
print(message)

# Task 2
# Написати програму, яка буде повертати для заданого року кількість днів.
# Рік є високосним, якщо він кратний 4, але не кратний 100, а також якщо він кратний 400

# year = int(input("enter year: "))
# days_in_year = 366 if (year % 4 == 0 and year % 100 != 0) or year % 400 == 0 else 365
# print(f"Days of year {year}: {days_in_year}")


# Task 3
# Трикутник існує лише тоді, коли сума будь-яких двох сторін більше третьої.
# Дано: A, B, C - сторони трикутника.
# Напишіть програму, яка вказує чи існує такий трикутник.

# a = int(input("Введіть довжину сторони A: "))
# b = int(input("Введіть довжину сторони B: "))
# c = int(input("Введіть довжину сторони C: "))
#
# chek = a + b > c and a + c > b and b + c > a
#
# if chek:
#     print("Трикутник існує.")
# else:
#     print("Трикутник не існує.")


from decimal import Decimal

f = Decimal('1232.345677')
f = round(f, )
print(f)
print(f)


