# Домашнє завдання (UA)
# Task 1
# Написати скрипт, який виводить задане число на екран, лише якщо введене число від’ємне.
#
# a = int(input('a='))
# if a < 0:
#     print (a)
# #
#
# Task 2
# Написати скрипт, який перевіряє, чи введене користувачем цілочисельне значення менше 20 чи ні.
#
# a = int(input('a='))
# print (a<20)
#
# Task 3
# Написати скрипт, який перевіряє, чи введене користувачем цілочисельне значення дорівнює нулю чи ні.
#
# a = int(input('a='))
# print (a==0)
#
# Task 4
# Написати скрипт, який перевіряє, чи введене користувачем цілочисельне значення є парним чи непарним.
#
# a = int(input('a='))
# if a%2 != 0:
#     print ('odd')
# else:
#     print('even')
#
# a = int(input('a='))
# if a % 2:
#      print('odd')
# else:
#      print ('Even')

#
# Task 5
# Написати скрипт, який повертає найбільше число серед трьох, які введені користувачем.
#
# if __name__ == '__main__':
#     a, b, c, = int(input('a=')),\
#                int(input('b=')),\
#                int(input('c='))
# print('Max=', max(a, b, c))
#
#
# Домашнє завдання (UA) - Додаткове
# Task 1
# Написати скрипт, який запитує користувача, чи він володіє посвідченням водія (yes або no).
# Якщо користувач відповідає "yes", виведи повідомлення "Ви можете керувати автомобілем".
# Якщо користувач відповідає "no", виведи повідомлення "Ви не можете керувати автомобілем".
#
# a = input('У вас є посвідчення водія ? ')
#
# if a == 'yes':
#     print('Ви можете керувати автомобілем')
# elif a == 'no':
#     print('Ви не можете керувати автомобілем')
# else:
#     print('введіть yes або no')
#
#
#
# Task 2
# Написати скрипт, який запитує користувача про його вік і перевіряє, чи він відповідає критеріям для отримання прав на керування автомобілем.
# Критерії: користувач повинен бути старше 18 років і мати посвідчення водія.
# Якщо користувач задовольняє критерії, виведи повідомлення "Ви можете отримати посвідчення водія".
# Якщо користувач не задовольняє критерії, виведи повідомлення "Ви не відповідаєте критеріям для отримання посвідчення водія".
#
# age = int(input('Скільки вам років ? '))
# document = input('У вас є посвідчення водія (ввести "yes" або "no" ? ')
# AGE1=18
#
# if document  == 'yes' and age >=AGE1:
#     print('Ви можете керувати автомобілем')
# else:
#     print('Ви не відповідаєте критеріям для права керуванням автомобіля')
#
# Task 3
# Написати скрипт, який перевіряє, чи введене число є додатнім і парним. Виведи повідомлення "Число є додатнім і парним",
# якщо число задовольняє обидва критерії. В іншому випадку, якщо число не є додатнім або не є парним, виведи повідомлення
# "Число не задовольняє критерії". Наприклад, якщо користувач вводить число 6, програма повинна вивести "Число є додатнім і парним".
# А якщо користувач вводить число -3, програма повинна вивести "Число не задовольняє критерії".
#
# a = int(input('a= '))
# if a>0 and a%2==0:
#     print("Число є додатнім і парним")
# else:
#     print("Число не задовольняє критерії")
#
# Task 4
# Написати скрипт, який перевіряє, чи введене число є кратним 3, але не є кратним 5.
# Якщо число задовольняє ці критерії, виведи повідомлення "Число підходить".
# В іншому випадку виведи повідомлення "Число не підходить".
#
# a = int(input('a= '))
# if a%3==0 and a%5!=0:
#     print("Число підходить")
# else:
#     print("Число не підходить")

# flat = int(input("Введіть номер квартири: "))
#
# entrance = (flat - 1) // 36 + 1
# floor = ((flat - 1) % 36) // 4 + 1
# apartment_on_floor = ((flat - 1) % 4) // 9 +1
# print (f"номер на поверсі: {apartment_on_floor}")
# print (f"номер на поверсі: {apartment_on_floor}")




